cmsis-svd/cmsis-svd/data/Infineon/psoc4100smax.svd
Note since the magnitude is 7-bits, the maximum shift is 6-bits. The sign bit does not form part of the shift.

Example: 6-bit polynomial (x^6 + x^4 + x^3 + x^2 + 1).

lfsr_fl_out[7] = lfsr_fl[5]; // Sign bit always connected in MSB to HardIP.
if(LFSR_SCALE_TYPE_FL == LEFT)
  lfsr_out[6:0] = {2'b00,lfsr[4:0]} &lt;&lt; LFSR_SCALE_FL; // Scaled 7-bit magnitude.
else
  lfsr_out[6:0] = {2'b00,lfsr[4:0]} &gt;&gt; LFSR_SCALE_FL; // Scaled 7-bit magnitude.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFSR_SCALE_TYPE_FL</name>
              <description>Flatspot/Dither CAPDAC shift direction.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SNS_CTL</name>
          <description>Sense Control and Command Register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC000FE00</resetValue>
          <resetMask>0xFFFFFFF7</resetMask>
          <fields>
            <field>
              <name>START_SCAN</name>
              <description>Start the MSCv3 sequencer scan process. The sequencer will clear this bit when it is done. Depending on the mode the sequencer is done when all NUM_SAMPLES for this scan have been accumulated, or if the sequencer is reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Indicator of sensor configuration validity.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LAST</name>
              <description>Indicator that current sensor configuration is the last sensor in the frame.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTI_CH_MODE</name>
              <description>Multi channel mode configuration. Determines whether consensus mechanism is engaged to ensure channels scan in lockstep. 
'0': Single channel.
'1': Wait for external sync (off-chip). 
'2': Wait for internal sync (on-chip).</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSE_MODE_SEL</name>
              <description>Sense mode register structure selection. This field allows quick change between registers that influence sense mode. This register selects which structure is currently 'live' and used by the IP.

These registers are captured in MODE_STRUCT. The usable values in this register is determined by design time parameter SENSE_MODE_NR.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENSE_MODE_0</name>
                  <description>Use MODE_STRUCT[0].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENSE_MODE_1</name>
                  <description>Use MODE_STRUCT[1].</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENSE_MODE_2</name>
                  <description>Use MODE_STRUCT[2].</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENSE_MODE_3</name>
                  <description>Use MODE_STRUCT[3].</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECIM_RATE</name>
              <description>Sets the decimation rate for the sinc^2 filter (CIC2). Typically referred to as N. Note N = DECIM_RATE + 1. Only applies when FILTER_CTL.FILTER_MODE = CIC2, and irrelevant for CIC1 mode (no effect in this mode).

Maximum value out of CIC2 is N^2 (unsigned input) and +/- N^2 (signed input).

Since CIC2 uses a 16-bit pipeline, the maximum range is [0,2^16-1] (unsigned) and [-2^15,2^15-1] (signed). This implies a limitation on maximum usable DECIM_RATE depending on BIT_FORMAT signed/unsigned.

BIT_FORMAT = UNSIGNED -&gt; DECIM_RATE(max) = 254 (N = 255).
BIT_FORMAT = SIGNED -&gt; DECIM_RATE(max) = 180 (N = 181).

The scan time for M-bit scan is 2^M clk_mod cycles. This value is determined by (SENSE_DIV+1)*(NUM_SUB_CONVS+1).

Note that the CIC2 filter does not operate in the EPILOGUE state, so NUM_EPI_CYCLES does not feed into the above equation.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SENSE_DIV</name>
              <description>The length (minus 1) of the sense modulation 'clock' period in clk_mod cycles (frequency = Fs). SENSE_DIV + 1 = sense_ratio.
Note this is the base divider, clock dithering may change the actual period length.

Firmware Rule: Firmware is responsible for programming a value in this register to ensure correct operation. When LFSR_MODE = DIRECT_CLOCK, in 2-phase mode sense_ratio needs to be &gt;=4 to allow for digital non-overlap. In 4-phase mode, sense_ratio needs to be &gt;=8. 

If spread spectrum is enabled (LFSR_MODE = SPREAD_SPECTRUM), SENSE_DIV must be programmed large enough to ensure that negative dithering does not cause sense_ratio to become too small.

